// const _ACT_VERSION_ = 1.0 // act : asgore converting table
// const _AFF_VERSION_ = 1.0 // aff : asgore font file
const _A_SEPARATOR_ = "█"
const _AFF_MIN_SEPARATOR = "/"
const _AFF_FILLER = "•"
const _CSV_DELIMITER_ = ","
const _CSV_QUOTECHAR_ = '"'
// zts : zip two strings
const _ZTA_SEPARATOR_ = "█" // zta : zip two arrays
const _ZTA_RANGE_ = /\{\d+:\d+\}/

const _ACT_DESC_ = `الحرف${_A_SEPARATOR_}أول${_A_SEPARATOR_}وسط${_A_SEPARATOR_}آخر${_A_SEPARATOR_}منفصل`
const _AFF_DESC_ = `Char${_A_SEPARATOR_}X${_A_SEPARATOR_}Y${_A_SEPARATOR_}Width${_A_SEPARATOR_}Height${_A_SEPARATOR_}Xoffset${_A_SEPARATOR_}Yoffset${_A_SEPARATOR_}Xadvance`


// function checkVersion(ver, index) {
  // if      (index == 0) {_VERSION_ = _ACT_VERSION_}
  // else if (index == 1) {_VERSION_ = _AFT_VERSION_}
  // else if (index == 2) {_VERSION_ = _AFF_VERSION_}
  // else {return}
  
  // if (parseFloat(ver) == _VERSION_) {return}
  // alert("النسخة {_VERSION_}معطوبة أو غير متوافقة.\n(ستتم العملية على أي حال.)")
// }

const ArabicChars = 'ٱٻپڀٺٿٹڤڦڄڃچڇڍڌڎڈژڑکگڳڱںڻۀہھےۓڭۇۆۈۋۅۉېیءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىي' // and Persian
const FreezedArabicChars = 'ﺀﺁﺂﺃﺄﺅﺆﺇﺈﺉﺊﺋﺌﺍﺎﺏﺐﺑﺒﺓﺔﺕﺖﺗﺘﺙﺚﺛﺜﺝﺞﺟﺠﺡﺢﺣﺤﺥﺦﺧﺨﺩﺪﺫﺬﺭﺮﺯﺰﺱﺲﺳﺴﺵﺶﺷﺸﺹﺺﺻﺼﺽﺾﺿﻀﻁﻂﻃﻄﻅﻆﻇﻈﻉﻊﻋﻌﻍﻎﻏﻐﻑﻒﻓﻔﻕﻖﻗﻘﻙﻚﻛﻜﻝﻞﻟﻠﻡﻢﻣﻤﻥﻦﻧﻨﻩﻪﻫﻬﻭﻮﻯﻰﻱﻲﻳﻴﻵﻶﻷﻸﻹﻺﻻﻼﭐﭑﭑﭐﭔﭕﭓﭒﭘﭙﭗﭖﭜﭝﭛﭚﭠﭡﭟﭞﭤﭥﭣﭢﭨﭩﭧﭦﭬﭭﭫﭪﭰﭱﭯﭮﭴﭵﭳﭲﭸﭹﭷﭶﭼﭽﭻﭺﮀﮁﭿﭾﮂﮃﮃﮂﮄﮅﮅﮄﮆﮇﮇﮆﮈﮉﮉﮈﮊﮋﮋﮊﮌﮍﮍﮌﮐﮑﮏﮎﮔﮕﮓﮒﮘﮙﮗﮖﮜﮝﮛﮚﯨﯩﮟﮞﮢﮣﮡﮠﮤﮥﮥﮤﮨﮩﮧﮦﮬﮭﮫﮪﮮﮯﮯﮮﮰﮱﮱﮰﯕﯖﯔﯓﯗﯘﯘﯗﯙﯚﯚﯙﯛﯜﯜﯛﯞﯟﯟﯞﯠﯡﯡﯠﯢﯣﯣﯢﯦﯧﯥﯤﯾﯿﯽﯼ'
const CharsConnectBoth = 'ئبتثجحخسشصضطظعغفقكلمنهيـٻپڀٺٿٹڤڦڄڃچڇکگڳڱںڻہھڭېی'
const CharsConnectBefore = 'آأؤإاةدذرزوىٱڍڌڎڈژڑۀےۓۇۆۈۋۅۉ'
const Harakat = 'ًٌٍَُِّْ'
const FreezedHarakat = 'ﱞﱟﱠﱡﱢﱣﳲﳳﳴﴼﴽﹰﹱﹲﹴﹶﹷﹸﹹﹺﹻﹼﹽﹾﹿ'
const EnglishChars = '?ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz'
const ASCII = ' !"#$%&\'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~'
const ExtendedASCII = '¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ'
const Symbols = '!"#$%&\'()*+,-./:;<=>@[\\]^_`{|}~'
const ArabicSymbols = '؟،؛ـ'
const Numbers = '0123456789٠١٢٣٤٥٦٧٨٩'
const NeutralChars = ' '
const Returns = '\r\n'
const BowsList = ['()', '[]', '{}', '<>', '＜＞', '「」', '《》', '〈〉', '『』', '【】', '〔〕', '〖〗', '〘〙', '〚〛', '❨❩', '❪❫', '❬❭', '❮❯', '❰❱', '❲❳', '❴❵']
const LaList = [['ﻟﺂ', 'ﻵ'], ['ﻠﺂ', 'ﻶ'], ['ﻟﺄ', 'ﻷ'], ['ﻠﺄ', 'ﻸ'], ['ﻟﺈ', 'ﻹ'], ['ﻠﺈ', 'ﻺ'], ['ﻟﺎ', 'ﻻ'], ['ﻠﺎ', 'ﻼ']]
const NotLastInLine = ['من', 'إلى', 'على', 'ثم', 'حتى', 'بدون', 'دون', 'لن', 'إذن', 'لما', 'كأن', 'لكن', 'ليت', 'لعل', 'ما', 'لو', 'إذا', 'يا', 'أيا', 'هيا', 'هل', 'مع', 'الذي', 'التي', 'الذان', 'اللتان', 'الذين', 'اللواتي', 'اللاتي', 'اللائي', 'و', 'أم', 'أن', 'إن', 'أو', 'أي', 'إي', 'بل', 'عن', 'في', 'قد',  'لقد', 'كي', 'لا', 'لم', 'مذ', 'منذ', 'ها', 'وا', 'وي', 'ألا', 'جير', 'خلا', 'رب', 'سوف', 'عدا', 'إلا',  'إما',  'أما',  'هلا',   'لولا',   'لوما']

const connectedHarakatTable = {
  'ﹷ' : ['ﹶ', 'َ'], 'ﹹ' : ['ﹸ', 'ُ'], 'ﹻ' : ['ﹺ', 'ِ'], 'ﹽ' : ['ﹼ', 'ّ'], 'ﹿ' : ['ﹾ', 'ْ'], 'ﹱ' : ['ﱟ', 'ﹰ', 'ً'],
  'ﳲ' : ['ﱠ'], 'ﳳ' : ['ﱡ'], 'ﳴ' : ['ﱢ']
}

const mergedHarakatTable = {//الترتيب مهم
  'ﱠ' : /[ّ,ﹼ][َ,ﹶ]/g, 'ﳲ' : /[ّ,ﹼ,ﹽ][َ,ﹶ,ﹷ]/g, 'ﱡ' : /[ّ,ﹼ][ُ,ﹸ]/g, 'ﳳ' : /[ّ,ﹼ,ﹽ][ُ,ﹸ,ﹹ]/g, 'ﱢ' : /[ّ,ﹼ][ِ,ﹺ]/g,
  'ﳴ' : /[ّ,ﹼ,ﹽ][ِ,ﹺ,ﹻ]/g, 'ﱞ' : /[ّ,ﹼ][ٌ,ﹲ]/g, 'ﱟ' : /[ّ,ﹼ][ٍ,ﹴ]/g
}

const freezedArabicTable = {//<initial><medial><final><isolated>
"ء" : ['ﺀ', 'ﺀ', 'ﺀ', 'ﺀ'], "آ" : ['ﺁ', 'ﺂ', 'ﺂ', 'ﺁ'], "أ" : ['ﺃ', 'ﺄ', 'ﺄ', 'ﺃ'], "ؤ" : ['ﺅ', 'ﺆ', 'ﺆ', 'ﺅ'],
"إ" : ['ﺇ', 'ﺈ', 'ﺈ', 'ﺇ'], "ئ" : ['ﺋ', 'ﺌ', 'ﺊ', 'ﺉ'], "ا" : ['ﺍ', 'ﺎ', 'ﺎ', 'ﺍ'], "ب" : ['ﺑ', 'ﺒ', 'ﺐ', 'ﺏ'],
"ة" : ['ﺓ', 'ﺔ', 'ﺔ', 'ﺓ'], "ت" : ['ﺗ', 'ﺘ', 'ﺖ', 'ﺕ'], "ث" : ['ﺛ', 'ﺜ', 'ﺚ', 'ﺙ'], "ج" : ['ﺟ', 'ﺠ', 'ﺞ', 'ﺝ'],
"ح" : ['ﺣ', 'ﺤ', 'ﺢ', 'ﺡ'], "خ" : ['ﺧ', 'ﺨ', 'ﺦ', 'ﺥ'], "د" : ['ﺩ', 'ﺪ', 'ﺪ', 'ﺩ'], "ذ" : ['ﺫ', 'ﺬ', 'ﺬ', 'ﺫ'],
"ر" : ['ﺭ', 'ﺮ', 'ﺮ', 'ﺭ'], "ز" : ['ﺯ', 'ﺰ', 'ﺰ', 'ﺯ'], "س" : ['ﺳ', 'ﺴ', 'ﺲ', 'ﺱ'], "ش" : ['ﺷ', 'ﺸ', 'ﺶ', 'ﺵ'],
"ص" : ['ﺻ', 'ﺼ', 'ﺺ', 'ﺹ'], "ض" : ['ﺿ', 'ﻀ', 'ﺾ', 'ﺽ'], "ط" : ['ﻃ', 'ﻄ', 'ﻂ', 'ﻁ'], "ظ" : ['ﻇ', 'ﻈ', 'ﻆ', 'ﻅ'],
"ع" : ['ﻋ', 'ﻌ', 'ﻊ', 'ﻉ'], "غ" : ['ﻏ', 'ﻐ', 'ﻎ', 'ﻍ'], "ف" : ['ﻓ', 'ﻔ', 'ﻒ', 'ﻑ'], "ق" : ['ﻗ', 'ﻘ', 'ﻖ', 'ﻕ'],
"ك" : ['ﻛ', 'ﻜ', 'ﻚ', 'ﻙ'], "ل" : ['ﻟ', 'ﻠ', 'ﻞ', 'ﻝ'], "م" : ['ﻣ', 'ﻤ', 'ﻢ', 'ﻡ'], "ن" : ['ﻧ', 'ﻨ', 'ﻦ', 'ﻥ'],
"ه" : ['ﻫ', 'ﻬ', 'ﻪ', 'ﻩ'], "و" : ['ﻭ', 'ﻮ', 'ﻮ', 'ﻭ'], "ى" : ['ﻯ', 'ﻰ', 'ﻰ', 'ﻯ'], "ي" : ['ﻳ', 'ﻴ', 'ﻲ', 'ﻱ'],
"لآ" : ['ﻵ', 'ﻶ', 'ﻶ', 'ﻵ'], "لأ" : ['ﻷ', 'ﻸ', 'ﻸ', 'ﻷ'], "لإ" : ['ﻹ', 'ﻺ', 'ﻺ', 'ﻹ'], "لا" : ['ﻻ', 'ﻼ', 'ﻼ', 'ﻻ'],
"پ" : ['ﭘ', 'ﭙ', 'ﭗ', 'ﭖ'], "چ" : ['ﭼ', 'ﭽ', 'ﭻ', 'ﭺ'], "ڤ" : ['ﭬ', 'ﭭ', 'ﭫ', 'ﭪ'], "ـ" : ['ـ', 'ـ', 'ـ', 'ـ'],
"ً"  : ['ﹰ', 'ﹰ', 'ﹰ', 'ﹰ'], "ٌ"  : ['ﹲ', 'ﹲ', 'ﹲ', 'ﹲ'], "ٍ"  : ['ﹴ', 'ﹴ', 'ﹴ', 'ﹴ'], "َ"  : ['ﹶ', 'ﹶ', 'ﹶ', 'ﹶ'],
"ُ"  : ['ﹸ', 'ﹸ', 'ﹸ', 'ﹸ'], "ِ"  : ['ﹺ', 'ﹺ', 'ﹺ', 'ﹺ'], "ّ"  : ['ﹼ', 'ﹼ', 'ﹼ', 'ﹼ'], "ْ"  : ['ﹾ', 'ﹾ', 'ﹾ', 'ﹾ'],
"ٱ" : ['ﭐ', 'ﭑ', 'ﭑ', 'ﭐ'], "ٻ" : ['ﭔ', 'ﭕ', 'ﭓ', 'ﭒ'], "پ" : ['ﭘ', 'ﭙ', 'ﭗ', 'ﭖ'], "ڀ" : ['ﭜ', 'ﭝ', 'ﭛ', 'ﭚ'],
"ٺ" : ['ﭠ', 'ﭡ', 'ﭟ', 'ﭞ'], "ٿ" : ['ﭤ', 'ﭥ', 'ﭣ', 'ﭢ'], "ٹ" : ['ﭨ', 'ﭩ', 'ﭧ', 'ﭦ'], "ڤ" : ['ﭬ', 'ﭭ', 'ﭫ', 'ﭪ'],
"ڦ" : ['ﭰ', 'ﭱ', 'ﭯ', 'ﭮ'], "ڄ" : ['ﭴ', 'ﭵ', 'ﭳ', 'ﭲ'], "ڃ" : ['ﭸ', 'ﭹ', 'ﭷ', 'ﭶ'], "چ" : ['ﭼ', 'ﭽ', 'ﭻ', 'ﭺ'],
"ڇ" : ['ﮀ', 'ﮁ', 'ﭿ', 'ﭾ'], "ڍ" : ['ﮂ', 'ﮃ', 'ﮃ', 'ﮂ'], "ڌ" : ['ﮄ', 'ﮅ', 'ﮅ', 'ﮄ'], "ڎ" : ['ﮆ', 'ﮇ', 'ﮇ', 'ﮆ'],
"ڈ" : ['ﮈ', 'ﮉ', 'ﮉ', 'ﮈ'], "ژ" : ['ﮊ', 'ﮋ', 'ﮋ', 'ﮊ'], "ڑ" : ['ﮌ', 'ﮍ', 'ﮍ', 'ﮌ'], "ک" : ['ﮐ', 'ﮑ', 'ﮏ', 'ﮎ'],
"گ" : ['ﮔ', 'ﮕ', 'ﮓ', 'ﮒ'], "ڳ" : ['ﮘ', 'ﮙ', 'ﮗ', 'ﮖ'], "ڱ" : ['ﮜ', 'ﮝ', 'ﮛ', 'ﮚ'], "ں" : ['ﯨ', 'ﯩ', 'ﮟ', 'ﮞ'],
"ڻ" : ['ﮢ', 'ﮣ', 'ﮡ', 'ﮠ'], "ۀ" : ['ﮤ', 'ﮥ', 'ﮥ', 'ﮤ'], "ہ" : ['ﮨ', 'ﮩ', 'ﮧ', 'ﮦ'], "ھ" : ['ﮬ', 'ﮭ', 'ﮫ', 'ﮪ'],
"ے" : ['ﮮ', 'ﮯ', 'ﮯ', 'ﮮ'], "ۓ" : ['ﮰ', 'ﮱ', 'ﮱ', 'ﮰ'], "ڭ" : ['ﯕ', 'ﯖ', 'ﯔ', 'ﯓ'], "ۇ" : ['ﯗ', 'ﯘ', 'ﯘ', 'ﯗ'],
"ۆ" : ['ﯙ', 'ﯚ', 'ﯚ', 'ﯙ'], "ۈ" : ['ﯛ', 'ﯜ', 'ﯜ', 'ﯛ'], "ۋ" : ['ﯞ', 'ﯟ', 'ﯟ', 'ﯞ'], "ۅ" : ['ﯠ', 'ﯡ', 'ﯡ', 'ﯠ'],
"ۉ" : ['ﯢ', 'ﯣ', 'ﯣ', 'ﯢ'], "ې" : ['ﯦ', 'ﯧ', 'ﯥ', 'ﯤ'], "ی" : ['ﯾ', 'ﯿ', 'ﯽ', 'ﯼ']
}

const mergedArabicChars = {
'ﺋﺎ' : 'ﯪ', 'ﺌﺎ' : 'ﯫ', 'ﺋﻪ' : 'ﯬ', 'ﺌﻪ' : 'ﯭ', 'ﺋﻮ' : 'ﯮ', 'ﺌﻮ' : 'ﯯ', 'ﺋﻲ' : 'ﰄ', 'ﺌﻲ' : 'ﱩ',
'ﺋﻴ' : 'ﯸ', 'ﺋﻰ' : 'ﰃ', 'ﺌﻰ' : 'ﱨ', 'ﺋﺞ' : 'ﰀ', 'ﺋﺢ' : 'ﰁ', 'ﺋﻢ' : 'ﰂ', 'ﺑﺞ' : 'ﰅ', 'ﺑﺢ' : 'ﰆ',
'ﺑﺦ' : 'ﰇ', 'ﺑﻢ' : 'ﰈ', 'ﺑﻰ' : 'ﰉ', 'ﺑﻲ' : 'ﰊ', 'ﺗﺞ' : 'ﰋ', 'ﺗﺢ' : 'ﰌ', 'ﺗﺦ' : 'ﰍ', 'ﺗﻢ' : 'ﰎ',
'ﺗﻰ' : 'ﰏ', 'ﺗﻲ' : 'ﰐ', 'ﺛﺞ' : 'ﰑ', 'ﺛﻢ' : 'ﰒ', 'ﺛﻰ' : 'ﰓ', 'ﺛﻲ' : 'ﰔ', 'ﺟﺢ' : 'ﰕ', 'ﺟﻢ' : 'ﰖ',
'ﺣﺞ' : 'ﰗ', 'ﺣﻢ' : 'ﰘ', 'ﺧﺞ' : 'ﰙ', 'ﺧﺢ' : 'ﰚ', 'ﺧﻢ' : 'ﰛ', 'ﺳﺞ' : 'ﰜ', 'ﺳﺢ' : 'ﰝ', 'ﺳﺦ' : 'ﰞ',
'ﺳﻢ' : 'ﰟ', 'ﺻﺢ' : 'ﰠ', 'ﺻﻢ' : 'ﰡ', 'ﺿﺞ' : 'ﰢ', 'ﺿﺢ' : 'ﰣ', 'ﺿﺦ' : 'ﰤ', 'ﺿﻢ' : 'ﰥ', 'ﻃﺢ' : 'ﰦ',
'ﻃﻢ' : 'ﰧ', 'ﻇﻢ' : 'ﰨ', 'ﻋﺞ' : 'ﰩ', 'ﻋﻢ' : 'ﰪ', 'ﻏﺞ' : 'ﰫ', 'ﻏﻢ' : 'ﰬ', 'ﻓﺞ' : 'ﰭ', 'ﻓﺢ' : 'ﰮ',
'ﻓﺦ' : 'ﰯ', 'ﻓﻢ' : 'ﰰ', 'ﻓﻰ' : 'ﰱ', 'ﻓﻲ' : 'ﰲ', 'ﻗﺢ' : 'ﰳ', 'ﻗﻢ' : 'ﰴ', 'ﻗﻰ' : 'ﰵ', 'ﻗﻲ' : 'ﰶ',
'ﻛﺎ' : 'ﰷ', 'ﻛﺞ' : 'ﰸ', 'ﻛﺢ' : 'ﰹ', 'ﻛﺦ' : 'ﰺ', 'ﻛﻞ' : 'ﰻ', 'ﻛﻢ' : 'ﰼ', 'ﻛﻰ' : 'ﰽ', 'ﻛﻲ' : 'ﰾ',
'ﻟﺞ' : 'ﰿ', 'ﻟﺢ' : 'ﱀ', 'ﻟﺦ' : 'ﱁ', 'ﻟﻢ' : 'ﱂ', 'ﻟﻰ' : 'ﱃ', 'ﻟﻲ' : 'ﱄ', 'ﻣﺞ' : 'ﱅ', 'ﻣﺢ' : 'ﱆ',
'ﻣﺦ' : 'ﱇ', 'ﻣﻢ' : 'ﱈ', 'ﻣﻰ' : 'ﱉ', 'ﻣﻲ' : 'ﱊ', 'ﻧﺞ' : 'ﱋ', 'ﻧﺢ' : 'ﱌ', 'ﻧﺦ' : 'ﱍ', 'ﻧﻢ' : 'ﱎ',
'ﻧﻰ' : 'ﱏ', 'ﻧﻲ' : 'ﱐ', 'ﻫﺞ' : 'ﱑ', 'ﻫﻢ' : 'ﱒ', 'ﻫﻰ' : 'ﱓ', 'ﻫﻲ' : 'ﱔ', 'ﻳﺞ' : 'ﱕ', 'ﻳﺢ' : 'ﱖ',
'ﻳﺦ' : 'ﱗ', 'ﻳﻢ' : 'ﱘ', 'ﻳﻰ' : 'ﱙ', 'ﻳﻲ' : 'ﱚ', 'ﹼﹲ' : 'ﱞ', 'ﹼﹴ' : 'ﱟ', 'ﹼﹶ' : 'ﱠ', 'ﹼﹸ' : 'ﱡ',
'ﹼﹺ' : 'ﱢ', 'ﺌﺮ' : 'ﱤ', 'ﺌﺰ' : 'ﱥ', 'ﺌﻢ' : 'ﱦ', 'ﺌﻦ' : 'ﱧ', 'ﺒﺮ' : 'ﱪ', 'ﺒﺰ' : 'ﱫ', 'ﺒﻢ' : 'ﱬ',
'ﺒﻦ' : 'ﱭ', 'ﺒﻰ' : 'ﱮ', 'ﺒﻲ' : 'ﱯ', 'ﺘﺮ' : 'ﱰ', 'ﺘﺰ' : 'ﱱ', 'ﺘﻢ' : 'ﱲ', 'ﺘﻦ' : 'ﱳ', 'ﺘﻰ' : 'ﱴ',
'ﺘﻲ' : 'ﱵ', 'ﺜﺮ' : 'ﱶ', 'ﺜﺰ' : 'ﱷ', 'ﺜﻢ' : 'ﱸ', 'ﺜﻦ' : 'ﱹ', 'ﺜﻰ' : 'ﱺ', 'ﺜﻲ' : 'ﱻ', 'ﻔﻰ' : 'ﱼ',
'ﻔﻲ' : 'ﱽ', 'ﻘﻰ' : 'ﱾ', 'ﻘﻲ' : 'ﱿ', 'ﻜﺎ' : 'ﲀ', 'ﻜﻞ' : 'ﲁ', 'ﻜﻢ' : 'ﲂ', 'ﻜﻰ' : 'ﲃ', 'ﻜﻲ' : 'ﲄ',
'ﻠﻢ' : 'ﲅ', 'ﻠﻰ' : 'ﲆ', 'ﻠﻲ' : 'ﲇ', 'ﻤﺎ' : 'ﲈ', 'ﻤﻢ' : 'ﲉ', 'ﻨﺮ' : 'ﲊ', 'ﻨﺰ' : 'ﲋ', 'ﻨﻢ' : 'ﲌ',
'ﻨﻦ' : 'ﲍ', 'ﻨﻰ' : 'ﲎ', 'ﻨﻲ' : 'ﲏ', 'ﻴﺮ' : 'ﲑ', 'ﻴﺰ' : 'ﲒ', 'ﻴﻢ' : 'ﲓ', 'ﻴﻦ' : 'ﲔ', 'ﻴﻰ' : 'ﲕ',
'ﻴﻲ' : 'ﲖ', 'ﺋﺠ' : 'ﲗ', 'ﺋﺤ' : 'ﲘ', 'ﺋﺨ' : 'ﲙ', 'ﺋﻤ' : 'ﲚ', 'ﺋﻬ' : 'ﲛ', 'ﺑﺠ' : 'ﲜ', 'ﺑﺤ' : 'ﲝ',
'ﺑﺨ' : 'ﲞ', 'ﺑﻤ' : 'ﲟ', 'ﺑﻬ' : 'ﲠ', 'ﺗﺠ' : 'ﲡ', 'ﺗﺤ' : 'ﲢ', 'ﺗﺨ' : 'ﲣ', 'ﺗﻤ' : 'ﲤ', 'ﺗﻬ' : 'ﲥ',
'ﺜﻤ' : 'ﳥ', 'ﺟﺤ' : 'ﲧ', 'ﺟﻤ' : 'ﲨ', 'ﺣﺠ' : 'ﲩ', 'ﺣﻤ' : 'ﲪ', 'ﺧﺠ' : 'ﲫ', 'ﺧﻤ' : 'ﲬ', 'ﺳﺠ' : 'ﲭ',
'ﺳﺤ' : 'ﲮ', 'ﺳﺨ' : 'ﲯ', 'ﺳﻤ' : 'ﲰ', 'ﺻﺤ' : 'ﲱ', 'ﺻﺨ' : 'ﲲ', 'ﺻﻤ' : 'ﲳ', 'ﺿﺠ' : 'ﲴ', 'ﺿﺤ' : 'ﲵ',
'ﺿﺨ' : 'ﲶ', 'ﺿﻤ' : 'ﲷ', 'ﻃﺤ' : 'ﲸ', 'ﻇﻤ' : 'ﲹ', 'ﻋﺠ' : 'ﲺ', 'ﻋﻤ' : 'ﲻ', 'ﻏﺠ' : 'ﲼ', 'ﻏﻤ' : 'ﲽ',
'ﻓﺠ' : 'ﲾ', 'ﻓﺤ' : 'ﲿ', 'ﻓﺨ' : 'ﳀ', 'ﻓﻤ' : 'ﳁ', 'ﻗﺤ' : 'ﳂ', 'ﻗﻤ' : 'ﳃ', 'ﻛﺠ' : 'ﳄ', 'ﻛﺤ' : 'ﳅ',
'ﻛﺨ' : 'ﳆ', 'ﻛﻠ' : 'ﳇ', 'ﻛﻤ' : 'ﳈ', 'ﻟﺠ' : 'ﳉ', 'ﻟﺤ' : 'ﳊ', 'ﻟﺨ' : 'ﳋ', 'ﻟﻤ' : 'ﳌ', 'ﻟﻬ' : 'ﳍ',
'ﻣﺠ' : 'ﳎ', 'ﻣﺤ' : 'ﳏ', 'ﻣﺨ' : 'ﳐ', 'ﻣﻤ' : 'ﳑ', 'ﻧﺠ' : 'ﳒ', 'ﻧﺤ' : 'ﳓ', 'ﻧﺨ' : 'ﳔ', 'ﻧﻤ' : 'ﳕ',
'ﻧﻬ' : 'ﳖ', 'ﻫﺠ' : 'ﳗ', 'ﻫﻤ' : 'ﳘ', 'ﻳﺠ' : 'ﳚ', 'ﻳﺤ' : 'ﳛ', 'ﻳﺨ' : 'ﳜ', 'ﻳﻤ' : 'ﳝ', 'ﻳﻬ' : 'ﳞ',
'ﺌﻤ' : 'ﳟ', 'ﺌﻬ' : 'ﳠ', 'ﺒﻤ' : 'ﳡ', 'ﺒﻬ' : 'ﳢ', 'ﺘﻤ' : 'ﳣ', 'ﺘﻬ' : 'ﳤ', 'ﺜﻬ' : 'ﳦ', 'ﺴﻤ' : 'ﳧ',
'ﺴﻬ' : 'ﳨ', 'ﺸﻤ' : 'ﳩ', 'ﺸﻬ' : 'ﳪ', 'ﻜﻠ' : 'ﳫ', 'ﻜﻤ' : 'ﳬ', 'ﻠﻤ' : 'ﳭ', 'ﻨﻤ' : 'ﳮ', 'ﻨﻬ' : 'ﳯ',
'ﻴﻤ' : 'ﳰ', 'ﻴﻬ' : 'ﳱ', 'ﻃﻰ' : 'ﳵ', 'ﻃﻲ' : 'ﳶ', 'ﻋﻰ' : 'ﳷ', 'ﻋﻲ' : 'ﳸ', 'ﻏﻰ' : 'ﳹ', 'ﻏﻲ' : 'ﳺ',
'ﺳﻰ' : 'ﳻ', 'ﺳﻲ' : 'ﳼ', 'ﺷﻰ' : 'ﳽ', 'ﺷﻲ' : 'ﳾ', 'ﺣﻰ' : 'ﳿ', 'ﺣﻲ' : 'ﴀ', 'ﺟﻰ' : 'ﴁ', 'ﺟﻲ' : 'ﴂ',
'ﺧﻰ' : 'ﴃ', 'ﺧﻲ' : 'ﴄ', 'ﺻﻰ' : 'ﴅ', 'ﺻﻲ' : 'ﴆ', 'ﺿﻰ' : 'ﴇ', 'ﺿﻲ' : 'ﴈ', 'ﺷﺞ' : 'ﴉ', 'ﺷﺢ' : 'ﴊ',
'ﺷﺦ' : 'ﴋ', 'ﺷﻢ' : 'ﴌ', 'ﺷﺮ' : 'ﴍ', 'ﺳﺮ' : 'ﴎ', 'ﺻﺮ' : 'ﴏ', 'ﺿﺮ' : 'ﴐ', 'ﻄﻰ' : 'ﴑ', 'ﻄﻲ' : 'ﴒ',
'ﻌﻰ' : 'ﴓ', 'ﻌﻲ' : 'ﴔ', 'ﻐﻰ' : 'ﴕ', 'ﻐﻲ' : 'ﴖ', 'ﺴﻰ' : 'ﴗ', 'ﺴﻲ' : 'ﴘ', 'ﺸﻰ' : 'ﴙ', 'ﺸﻲ' : 'ﴚ',
'ﺤﻰ' : 'ﴛ', 'ﺤﻲ' : 'ﴜ', 'ﺠﻰ' : 'ﴝ', 'ﺠﻲ' : 'ﴞ', 'ﺨﻰ' : 'ﴟ', 'ﺨﻲ' : 'ﴠ', 'ﺼﻰ' : 'ﴡ', 'ﺼﻲ' : 'ﴢ',
'ﻀﻰ' : 'ﴣ', 'ﻀﻲ' : 'ﴤ', 'ﺸﺞ' : 'ﴥ', 'ﺸﺢ' : 'ﴦ', 'ﺸﺦ' : 'ﴧ', 'ﺸﻢ' : 'ﴨ', 'ﺸﺮ' : 'ﴩ', 'ﺴﺮ' : 'ﴪ',
'ﺼﺮ' : 'ﴫ', 'ﻀﺮ' : 'ﴬ', 'ﺷﺠ' : 'ﴭ', 'ﺷﺤ' : 'ﴮ', 'ﺷﺨ' : 'ﴯ', 'ﺷﻤ' : 'ﴰ', 'ﺳﻬ' : 'ﴱ', 'ﺷﻬ' : 'ﴲ',
'ﻃﻤ' : 'ﴳ', 'ﺴﺠ' : 'ﴴ', 'ﺴﺤ' : 'ﴵ', 'ﺴﺨ' : 'ﴶ', 'ﺸﺠ' : 'ﴷ', 'ﺸﺤ' : 'ﴸ', 'ﺸﺨ' : 'ﴹ', 'ﻄﻤ' : 'ﴺ',
'ﻈﻤ' : 'ﴻ', 'ﺎﹰ' : 'ﴼ', 'ﺍﹰ' : 'ﴽ', 'ﺎﱟ' : 'ﴼ', 'ﺍﱟ' : 'ﴽ',
'ﺗﺠﻤ' : 'ﵐ', 'ﺘﺤﺞ' : 'ﵑ', 'ﺗﺤﺠ' : 'ﵒ', 'ﺗﺤﻤ' : 'ﵓ', 'ﺗﺨﻤ' : 'ﵔ', 'ﺗﻤﺠ' : 'ﵕ', 'ﺗﻤﺤ' : 'ﵖ', 'ﺗﻤﺨ' : 'ﵗ',
'ﺠﻤﺢ' : 'ﵘ', 'ﺟﻤﺤ' : 'ﵙ', 'ﺤﻤﻲ' : 'ﵚ', 'ﺤﻤﻰ' : 'ﵛ', 'ﺳﺤﺠ' : 'ﵜ', 'ﺳﺠﺤ' : 'ﵝ', 'ﺴﺠﻰ' : 'ﵞ', 'ﺴﻤﺢ' : 'ﵟ',
'ﺳﻤﺤ' : 'ﵠ', 'ﺳﻤﺠ' : 'ﵡ', 'ﺴﻤﻢ' : 'ﵢ', 'ﺳﻤﻤ' : 'ﵣ', 'ﺼﺤﺢ' : 'ﵤ', 'ﺻﺤﺤ' : 'ﵥ', 'ﺼﻤﻢ' : 'ﵦ', 'ﺸﺤﻢ' : 'ﵧ',
'ﺷﺤﻤ' : 'ﵨ', 'ﺸﺠﻲ' : 'ﵩ', 'ﺸﻤﺦ' : 'ﵪ', 'ﺷﻤﺨ' : 'ﵫ', 'ﺸﻤﻢ' : 'ﵬ', 'ﺷﻤﻤ' : 'ﵭ', 'ﻀﺤﻰ' : 'ﵮ', 'ﻀﺨﻢ' : 'ﵯ',
'ﺿﺨﻤ' : 'ﵰ', 'ﻄﻤﺢ' : 'ﵱ', 'ﻃﻤﺤ' : 'ﵲ', 'ﻃﻤﻤ' : 'ﵳ', 'ﻄﻤﻲ' : 'ﵴ', 'ﻌﺠﻢ' : 'ﵵ', 'ﻌﻤﻢ' : 'ﵶ', 'ﻋﻤﻤ' : 'ﵷ',
'ﻌﻤﻰ' : 'ﵸ', 'ﻐﻤﻢ' : 'ﵹ', 'ﻐﻤﻲ' : 'ﵺ', 'ﻐﻤﻰ' : 'ﵻ', 'ﻔﺨﻢ' : 'ﵼ', 'ﻓﺨﻤ' : 'ﵽ', 'ﻘﻤﺢ' : 'ﵾ', 'ﻘﻤﻢ' : 'ﵿ',
'ﻠﺤﻢ' : 'ﶀ', 'ﻠﺤﻲ' : 'ﶁ', 'ﻠﺤﻰ' : 'ﶂ', 'ﻟﺠﺠ' : 'ﶃ', 'ﻠﺠﺞ' : 'ﶄ', 'ﻠﺨﻢ' : 'ﶅ', 'ﻟﺨﻤ' : 'ﶆ', 'ﻠﻤﺢ' : 'ﶇ',
'ﻟﻤﺤ' : 'ﶈ', 'ﻣﺤﺠ' : 'ﶉ', 'ﻣﺤﻤ' : 'ﶊ', 'ﻤﺤﻲ' : 'ﶋ', 'ﻣﺠﺤ' : 'ﶌ', 'ﻣﺠﻤ' : 'ﶍ', 'ﻣﺨﺠ' : 'ﶎ', 'ﻣﺨﻤ' : 'ﶏ',
'ﻣﺠﺨ' : 'ﶒ', 'ﻫﻤﺠ' : 'ﶓ', 'ﻫﻤﻤ' : 'ﶔ', 'ﻧﺤﻤ' : 'ﶕ', 'ﻨﺤﻰ' : 'ﶖ', 'ﻨﺤﻢ' : 'ﶗ', 'ﻧﺠﻤ' : 'ﶘ', 'ﻨﺠﻰ' : 'ﶙ',
'ﻨﻤﻲ' : 'ﶚ', 'ﻨﻤﻰ' : 'ﶛ', 'ﻴﻤﻢ' : 'ﶜ', 'ﻳﻤﻤ' : 'ﶝ', 'ﺒﺨﻲ' : 'ﶞ', 'ﺘﺠﻲ' : 'ﶟ', 'ﺘﺠﻰ' : 'ﶠ', 'ﺘﺨﻲ' : 'ﶡ',
'ﺘﺨﻰ' : 'ﶢ', 'ﺘﻤﻲ' : 'ﶣ', 'ﺘﻤﻰ' : 'ﶤ', 'ﺠﻤﻲ' : 'ﶥ', 'ﺠﺤﻰ' : 'ﶦ', 'ﺠﻤﻰ' : 'ﶧ', 'ﺴﺨﻰ' : 'ﶨ', 'ﺼﺤﻲ' : 'ﶩ',
'ﺸﺤﻲ' : 'ﶪ', 'ﻀﺤﻲ' : 'ﶫ', 'ﻠﺠﻲ' : 'ﶬ', 'ﻠﻤﻲ' : 'ﶭ', 'ﻴﺤﻲ' : 'ﶮ', 'ﻴﺠﻲ' : 'ﶯ', 'ﻴﻤﻲ' : 'ﶰ', 'ﻤﻤﻲ' : 'ﶱ',
'ﻘﻤﻲ' : 'ﶲ', 'ﻨﺤﻲ' : 'ﶳ', 'ﻗﻤﺤ' : 'ﶴ', 'ﻟﺤﻤ' : 'ﶵ', 'ﻌﻤﻲ' : 'ﶶ', 'ﻜﻤﻲ' : 'ﶷ', 'ﻧﺠﺤ' : 'ﶸ', 'ﻤﺨﻲ' : 'ﶹ',
'ﻟﺠﻤ' : 'ﶺ', 'ﻜﻤﻢ' : 'ﶻ', 'ﻠﺠﻢ' : 'ﶼ', 'ﻨﺠﺢ' : 'ﶽ', 'ﺠﺤﻲ' : 'ﶾ', 'ﺤﺠﻲ' : 'ﶿ', 'ﻤﺠﻲ' : 'ﷀ', 'ﻔﻤﻲ' : 'ﷁ',
'ﺒﺤﻲ' : 'ﷂ', 'ﻛﻤﻤ' : 'ﷃ', 'ﻋﺠﻤ' : 'ﷄ', 'ﺻﻤﻤ' : 'ﷅ', 'ﺴﺨﻲ' : 'ﷆ', 'ﻨﺠﻲ' : 'ﷇ',
'ﺍﻟﻠﻪ' : 'ﷲ', 'ﺍﻛﺒﺮ' : 'ﷳ', 'ﻣﺤﻤﺪ' : 'ﷴ', 'ﺻﻠﻌﻢ' : 'ﷵ', 'ﺭﺳﻮﻝ' : 'ﷶ', 'ﺻﻠﻰ ﺍﻟﻠﻪ ﻋﻠﻴﻪ ﻭﺳﻠﻢ' : 'ﷺ', 'ﻋﻠﻴﻪ' : 'ﷷ',
'ﻭﺳﻠﻢ' : 'ﷸ', 'ﺻﻠﻰ' : 'ﷹ', 'ﺟﻞ ﺟﻼﻟﻪ' : 'ﷻ', 'ﺭﻳﺎﻝ' : '﷼', 'ﺑﺴﻢ ﺍﻟﻠﻪ ﺍﻟﺮﺣﻤﻦ ﺍﻟﺮﺣﻴﻢ' : '﷽'
}
