// const _ACT_VERSION_ = 1.0 // act : asgore converting table
// const _AFF_VERSION_ = 1.0 // aff : asgore font file
const A_SEPARATOR = "█"
const AFF_MIN_SEPARATOR = "/"
const AFF_FILLER = "•"
const CSV_DELIMITER = ","
const CSV_QUOTECHAR = '"'
// zts : zip two strings
const ZTA_SEPARATOR = "█" // zta : zip two arrays
const ZTA_RANGE = /\{(.):(\d+)\}/g

const ACT_DESC = `الحرف${A_SEPARATOR}أول${A_SEPARATOR}وسط${A_SEPARATOR}آخر${A_SEPARATOR}منفصل`
const AFF_DESC = `Char${A_SEPARATOR}X${A_SEPARATOR}Y${A_SEPARATOR}Width${A_SEPARATOR}Height${A_SEPARATOR}Xoffset${A_SEPARATOR}Yoffset${A_SEPARATOR}Xadvance`


// function checkVersion(ver, index) {
  // if      (index == 0) {_VERSION_ = _ACT_VERSION_}
  // else if (index == 1) {_VERSION_ = _AFT_VERSION_}
  // else if (index == 2) {_VERSION_ = _AFF_VERSION_}
  // else {return}
  
  // if (parseFloat(ver) == _VERSION_) {return}
  // alert("النسخة {_VERSION_}معطوبة أو غير متوافقة.\n(ستتم العملية على أي حال.)")
// }

const ARABIC_CHARS = 'ٱٻپڀٺٿٹڤڦڄڃچڇڍڌڎڈژڑکگڳڱںڻۀہھےۓڭۇۆۈۋۅۉېیءآأؤإئابةتثجحخدذرزسشصضطظعغفقكلمنهوىي' // and Persian
const FREEZED_ARABIC_CHARS = 'ﺀﺁﺂﺃﺄﺅﺆﺇﺈﺉﺊﺋﺌﺍﺎﺏﺐﺑﺒﺓﺔﺕﺖﺗﺘﺙﺚﺛﺜﺝﺞﺟﺠﺡﺢﺣﺤﺥﺦﺧﺨﺩﺪﺫﺬﺭﺮﺯﺰﺱﺲﺳﺴﺵﺶﺷﺸﺹﺺﺻﺼﺽﺾﺿﻀﻁﻂﻃﻄﻅﻆﻇﻈﻉﻊﻋﻌﻍﻎﻏﻐﻑﻒﻓﻔﻕﻖﻗﻘﻙﻚﻛﻜﻝﻞﻟﻠﻡﻢﻣﻤﻥﻦﻧﻨﻩﻪﻫﻬﻭﻮﻯﻰﻱﻲﻳﻴﻵﻶﻷﻸﻹﻺﻻﻼﭐﭑﭑﭐﭔﭕﭓﭒﭘﭙﭗﭖﭜﭝﭛﭚﭠﭡﭟﭞﭤﭥﭣﭢﭨﭩﭧﭦﭬﭭﭫﭪﭰﭱﭯﭮﭴﭵﭳﭲﭸﭹﭷﭶﭼﭽﭻﭺﮀﮁﭿﭾﮂﮃﮃﮂﮄﮅﮅﮄﮆﮇﮇﮆﮈﮉﮉﮈﮊﮋﮋﮊﮌﮍﮍﮌﮐﮑﮏﮎﮔﮕﮓﮒﮘﮙﮗﮖﮜﮝﮛﮚﯨﯩﮟﮞﮢﮣﮡﮠﮤﮥﮥﮤﮨﮩﮧﮦﮬﮭﮫﮪﮮﮯﮯﮮﮰﮱﮱﮰﯕﯖﯔﯓﯗﯘﯘﯗﯙﯚﯚﯙﯛﯜﯜﯛﯞﯟﯟﯞﯠﯡﯡﯠﯢﯣﯣﯢﯦﯧﯥﯤﯾﯿﯽﯼ'
const CHARS_CONNECT_BOTH = 'ئبتثجحخسشصضطظعغفقكلمنهيـٻپڀٺٿٹڤڦڄڃچڇکگڳڱںڻہھڭېی'
const CHARS_CONNECT_BEFORE = 'آأؤإاةدذرزوىٱڍڌڎڈژڑۀےۓۇۆۈۋۅۉ'
const HARAKAT = 'ًٌٍَُِّْ'
const FREEZED_HARAKAT = 'ﱞﱟﱠﱡﱢﱣﳲﳳﳴﴼﴽﹰﹱﹲﹴﹶﹷﹸﹹﹺﹻﹼﹽﹾﹿ'
const ASCII = ' !"#$%&\'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~'
const EXTENDED_ASCII = '¡¢£¤¥¦§¨©ª«¬­®¯°±²³´µ¶·¸¹º»¼½¾¿ÀÁÂÃÄÅÆÇÈÉÊËÌÍÎÏÐÑÒÓÔÕÖ×ØÙÚÛÜÝÞßàáâãäåæçèéêëìíîïðñòóôõö÷øùúûüýþÿ'
const ARABIC_SYMBOLS = '؟،؛ـ'
const RETURNS = '\r\n'
const BOWS_LIST = ['()', '[]', '{}', '<>', '＜＞', '「」', '《》', '〈〉', '『』', '【】', '〔〕', '〖〗', '〘〙', '〚〛', '❨❩', '❪❫', '❬❭', '❮❯', '❰❱', '❲❳', '❴❵']
const NOT_LAST_IN_LINE = ['من', 'إلى', 'على', 'ثم', 'حتى', 'بدون', 'دون', 'لن', 'إذن', 'لما', 'كأن', 'لكن', 'ليت', 'لعل', 'ما', 'لو', 'إذا', 'يا', 'أيا', 'هيا', 'هل', 'مع', 'الذي', 'التي', 'الذان', 'اللتان', 'الذين', 'اللواتي', 'اللاتي', 'اللائي', 'و', 'أم', 'أن', 'إن', 'أو', 'أي', 'إي', 'بل', 'عن', 'في', 'قد',  'لقد', 'كي', 'لا', 'لم', 'مذ', 'منذ', 'ها', 'وا', 'وي', 'ألا', 'جير', 'خلا', 'رب', 'سوف', 'عدا', 'إلا',  'إما',  'أما',  'هلا',   'لولا',   'لوما']

const CONNECTED_HARAKAT_TABLE = {
  'ﹷ' : ['ﹶ', 'َ'], 'ﹹ' : ['ﹸ', 'ُ'], 'ﹻ' : ['ﹺ', 'ِ'], 'ﹽ' : ['ﹼ', 'ّ'], 'ﹿ' : ['ﹾ', 'ْ'], 'ﹱ' : ['ﱟ', 'ﹰ', 'ً'], 'ﳲ' : ['ﱠ'], 'ﳳ' : ['ﱡ'], 'ﳴ' : ['ﱢ']
}

const MERGED_HARAKAT_TABLE = {//الترتيب مهم
  'ﱠ' : /[ّ,ﹼ][َ,ﹶ]/g, 'ﳲ' : /[ّ,ﹼ,ﹽ][َ,ﹶ,ﹷ]/g, 'ﱡ' : /[ّ,ﹼ][ُ,ﹸ]/g, 'ﳳ' : /[ّ,ﹼ,ﹽ][ُ,ﹸ,ﹹ]/g, 'ﱢ' : /[ّ,ﹼ][ِ,ﹺ]/g, 'ﳴ' : /[ّ,ﹼ,ﹽ][ِ,ﹺ,ﹻ]/g,
  'ﱞ' : /[ّ,ﹼ][ٌ,ﹲ]/g, 'ﱟ' : /[ّ,ﹼ][ٍ,ﹴ]/g
}

const FREEZED_ARABIC_TABLE = {//<initial><medial><final><isolated>
  // "ء" : ['ﺀ', 'ﺀ', 'ﺀ', 'ﺀ'], "آ" : ['ﺁ', 'ﺂ', 'ﺂ', 'ﺁ'], "أ" : ['ﺃ', 'ﺄ', 'ﺄ', 'ﺃ'], "ؤ" : ['ﺅ', 'ﺆ', 'ﺆ', 'ﺅ'],
  // "إ" : ['ﺇ', 'ﺈ', 'ﺈ', 'ﺇ'], "ئ" : ['ﺋ', 'ﺌ', 'ﺊ', 'ﺉ'], "ا" : ['ﺍ', 'ﺎ', 'ﺎ', 'ﺍ'], "ب" : ['ﺑ', 'ﺒ', 'ﺐ', 'ﺏ'],
  // "ة" : ['ﺓ', 'ﺔ', 'ﺔ', 'ﺓ'], "ت" : ['ﺗ', 'ﺘ', 'ﺖ', 'ﺕ'], "ث" : ['ﺛ', 'ﺜ', 'ﺚ', 'ﺙ'], "ج" : ['ﺟ', 'ﺠ', 'ﺞ', 'ﺝ'],
  // "ح" : ['ﺣ', 'ﺤ', 'ﺢ', 'ﺡ'], "خ" : ['ﺧ', 'ﺨ', 'ﺦ', 'ﺥ'], "د" : ['ﺩ', 'ﺪ', 'ﺪ', 'ﺩ'], "ذ" : ['ﺫ', 'ﺬ', 'ﺬ', 'ﺫ'],
  // "ر" : ['ﺭ', 'ﺮ', 'ﺮ', 'ﺭ'], "ز" : ['ﺯ', 'ﺰ', 'ﺰ', 'ﺯ'], "س" : ['ﺳ', 'ﺴ', 'ﺲ', 'ﺱ'], "ش" : ['ﺷ', 'ﺸ', 'ﺶ', 'ﺵ'],
  // "ص" : ['ﺻ', 'ﺼ', 'ﺺ', 'ﺹ'], "ض" : ['ﺿ', 'ﻀ', 'ﺾ', 'ﺽ'], "ط" : ['ﻃ', 'ﻄ', 'ﻂ', 'ﻁ'], "ظ" : ['ﻇ', 'ﻈ', 'ﻆ', 'ﻅ'],
  // "ع" : ['ﻋ', 'ﻌ', 'ﻊ', 'ﻉ'], "غ" : ['ﻏ', 'ﻐ', 'ﻎ', 'ﻍ'], "ف" : ['ﻓ', 'ﻔ', 'ﻒ', 'ﻑ'], "ق" : ['ﻗ', 'ﻘ', 'ﻖ', 'ﻕ'],
  // "ك" : ['ﻛ', 'ﻜ', 'ﻚ', 'ﻙ'], "ل" : ['ﻟ', 'ﻠ', 'ﻞ', 'ﻝ'], "م" : ['ﻣ', 'ﻤ', 'ﻢ', 'ﻡ'], "ن" : ['ﻧ', 'ﻨ', 'ﻦ', 'ﻥ'],
  // "ه" : ['ﻫ', 'ﻬ', 'ﻪ', 'ﻩ'], "و" : ['ﻭ', 'ﻮ', 'ﻮ', 'ﻭ'], "ى" : ['ﻯ', 'ﻰ', 'ﻰ', 'ﻯ'], "ي" : ['ﻳ', 'ﻴ', 'ﻲ', 'ﻱ'],
  // "لآ" : ['ﻵ', 'ﻶ', 'ﻶ', 'ﻵ'], "لأ" : ['ﻷ', 'ﻸ', 'ﻸ', 'ﻷ'], "لإ" : ['ﻹ', 'ﻺ', 'ﻺ', 'ﻹ'], "لا" : ['ﻻ', 'ﻼ', 'ﻼ', 'ﻻ'],
  // "پ" : ['ﭘ', 'ﭙ', 'ﭗ', 'ﭖ'], "چ" : ['ﭼ', 'ﭽ', 'ﭻ', 'ﭺ'], "ڤ" : ['ﭬ', 'ﭭ', 'ﭫ', 'ﭪ'], "ـ" : ['ـ', 'ـ', 'ـ', 'ـ'],
  // "ً"  : ['ﹰ', 'ﹰ', 'ﹰ', 'ﹰ'], "ٌ"  : ['ﹲ', 'ﹲ', 'ﹲ', 'ﹲ'], "ٍ"  : ['ﹴ', 'ﹴ', 'ﹴ', 'ﹴ'], "َ"  : ['ﹶ', 'ﹶ', 'ﹶ', 'ﹶ'],
  // "ُ"  : ['ﹸ', 'ﹸ', 'ﹸ', 'ﹸ'], "ِ"  : ['ﹺ', 'ﹺ', 'ﹺ', 'ﹺ'], "ّ"  : ['ﹼ', 'ﹼ', 'ﹼ', 'ﹼ'], "ْ"  : ['ﹾ', 'ﹾ', 'ﹾ', 'ﹾ'],
  // "ٱ" : ['ﭐ', 'ﭑ', 'ﭑ', 'ﭐ'], "ٻ" : ['ﭔ', 'ﭕ', 'ﭓ', 'ﭒ'], "پ" : ['ﭘ', 'ﭙ', 'ﭗ', 'ﭖ'], "ڀ" : ['ﭜ', 'ﭝ', 'ﭛ', 'ﭚ'],
  // "ٺ" : ['ﭠ', 'ﭡ', 'ﭟ', 'ﭞ'], "ٿ" : ['ﭤ', 'ﭥ', 'ﭣ', 'ﭢ'], "ٹ" : ['ﭨ', 'ﭩ', 'ﭧ', 'ﭦ'], "ڤ" : ['ﭬ', 'ﭭ', 'ﭫ', 'ﭪ'],
  // "ڦ" : ['ﭰ', 'ﭱ', 'ﭯ', 'ﭮ'], "ڄ" : ['ﭴ', 'ﭵ', 'ﭳ', 'ﭲ'], "ڃ" : ['ﭸ', 'ﭹ', 'ﭷ', 'ﭶ'], "چ" : ['ﭼ', 'ﭽ', 'ﭻ', 'ﭺ'],
  // "ڇ" : ['ﮀ', 'ﮁ', 'ﭿ', 'ﭾ'], "ڍ" : ['ﮂ', 'ﮃ', 'ﮃ', 'ﮂ'], "ڌ" : ['ﮄ', 'ﮅ', 'ﮅ', 'ﮄ'], "ڎ" : ['ﮆ', 'ﮇ', 'ﮇ', 'ﮆ'],
  // "ڈ" : ['ﮈ', 'ﮉ', 'ﮉ', 'ﮈ'], "ژ" : ['ﮊ', 'ﮋ', 'ﮋ', 'ﮊ'], "ڑ" : ['ﮌ', 'ﮍ', 'ﮍ', 'ﮌ'], "ک" : ['ﮐ', 'ﮑ', 'ﮏ', 'ﮎ'],
  // "گ" : ['ﮔ', 'ﮕ', 'ﮓ', 'ﮒ'], "ڳ" : ['ﮘ', 'ﮙ', 'ﮗ', 'ﮖ'], "ڱ" : ['ﮜ', 'ﮝ', 'ﮛ', 'ﮚ'], "ں" : ['ﯨ', 'ﯩ', 'ﮟ', 'ﮞ'],
  // "ڻ" : ['ﮢ', 'ﮣ', 'ﮡ', 'ﮠ'], "ۀ" : ['ﮤ', 'ﮥ', 'ﮥ', 'ﮤ'], "ہ" : ['ﮨ', 'ﮩ', 'ﮧ', 'ﮦ'], "ھ" : ['ﮬ', 'ﮭ', 'ﮫ', 'ﮪ'],
  // "ے" : ['ﮮ', 'ﮯ', 'ﮯ', 'ﮮ'], "ۓ" : ['ﮰ', 'ﮱ', 'ﮱ', 'ﮰ'], "ڭ" : ['ﯕ', 'ﯖ', 'ﯔ', 'ﯓ'], "ۇ" : ['ﯗ', 'ﯘ', 'ﯘ', 'ﯗ'],
  // "ۆ" : ['ﯙ', 'ﯚ', 'ﯚ', 'ﯙ'], "ۈ" : ['ﯛ', 'ﯜ', 'ﯜ', 'ﯛ'], "ۋ" : ['ﯞ', 'ﯟ', 'ﯟ', 'ﯞ'], "ۅ" : ['ﯠ', 'ﯡ', 'ﯡ', 'ﯠ'],
  // "ۉ" : ['ﯢ', 'ﯣ', 'ﯣ', 'ﯢ'], "ې" : ['ﯦ', 'ﯧ', 'ﯥ', 'ﯤ'], "ی" : ['ﯾ', 'ﯿ', 'ﯽ', 'ﯼ']
  // <isolated><final><initial><medial>
  'ء': ['ﺀ', 'ﺀ', 'ﺀ', 'ﺀ'], 'آ': ['ﺁ', 'ﺂ', 'ﺁ', 'ﺂ'], 'أ': ['ﺃ', 'ﺄ', 'ﺃ', 'ﺄ'], 'ؤ': ['ﺅ', 'ﺆ', 'ﺅ', 'ﺆ'],
  'إ': ['ﺇ', 'ﺈ', 'ﺇ', 'ﺈ'], 'ئ': ['ﺉ', 'ﺊ', 'ﺋ', 'ﺌ'], 'ا': ['ﺍ', 'ﺎ', 'ﺍ', 'ﺎ'], 'ب': ['ﺏ', 'ﺐ', 'ﺑ', 'ﺒ'],
  'ة': ['ﺓ', 'ﺔ', 'ﺓ', 'ﺔ'], 'ت': ['ﺕ', 'ﺖ', 'ﺗ', 'ﺘ'], 'ث': ['ﺙ', 'ﺚ', 'ﺛ', 'ﺜ'], 'ج': ['ﺝ', 'ﺞ', 'ﺟ', 'ﺠ'],
  'ح': ['ﺡ', 'ﺢ', 'ﺣ', 'ﺤ'], 'خ': ['ﺥ', 'ﺦ', 'ﺧ', 'ﺨ'], 'د': ['ﺩ', 'ﺪ', 'ﺩ', 'ﺪ'], 'ذ': ['ﺫ', 'ﺬ', 'ﺫ', 'ﺬ'],
  'ر': ['ﺭ', 'ﺮ', 'ﺭ', 'ﺮ'], 'ز': ['ﺯ', 'ﺰ', 'ﺯ', 'ﺰ'], 'س': ['ﺱ', 'ﺲ', 'ﺳ', 'ﺴ'], 'ش': ['ﺵ', 'ﺶ', 'ﺷ', 'ﺸ'],
  'ص': ['ﺹ', 'ﺺ', 'ﺻ', 'ﺼ'], 'ض': ['ﺽ', 'ﺾ', 'ﺿ', 'ﻀ'], 'ط': ['ﻁ', 'ﻂ', 'ﻃ', 'ﻄ'], 'ظ': ['ﻅ', 'ﻆ', 'ﻇ', 'ﻈ'],
  'ع': ['ﻉ', 'ﻊ', 'ﻋ', 'ﻌ'], 'غ': ['ﻍ', 'ﻎ', 'ﻏ', 'ﻐ'], 'ف': ['ﻑ', 'ﻒ', 'ﻓ', 'ﻔ'], 'ق': ['ﻕ', 'ﻖ', 'ﻗ', 'ﻘ'],
  'ك': ['ﻙ', 'ﻚ', 'ﻛ', 'ﻜ'], 'ل': ['ﻝ', 'ﻞ', 'ﻟ', 'ﻠ'], 'م': ['ﻡ', 'ﻢ', 'ﻣ', 'ﻤ'], 'ن': ['ﻥ', 'ﻦ', 'ﻧ', 'ﻨ'],
  'ه': ['ﻩ', 'ﻪ', 'ﻫ', 'ﻬ'], 'و': ['ﻭ', 'ﻮ', 'ﻭ', 'ﻮ'], 'ى': ['ﻯ', 'ﻰ', 'ﻯ', 'ﻰ'], 'ي': ['ﻱ', 'ﻲ', 'ﻳ', 'ﻴ'],
  'پ': ['ﭖ', 'ﭗ', 'ﭘ', 'ﭙ'], 'چ': ['ﭺ', 'ﭻ', 'ﭼ', 'ﭽ'], 'ڤ': ['ﭪ', 'ﭫ', 'ﭬ', 'ﭭ'], 'ـ': ['ـ', 'ـ', 'ـ', 'ـ'],
  'ً' : ['ﹰ', 'ﹰ', 'ﹰ', 'ﹰ'], 'ٌ' : ['ﹲ', 'ﹲ', 'ﹲ', 'ﹲ'], 'ٍ' : ['ﹴ', 'ﹴ', 'ﹴ', 'ﹴ'], 'َ' : ['ﹶ', 'ﹶ', 'ﹶ', 'ﹶ'],
  'ُ' : ['ﹸ', 'ﹸ', 'ﹸ', 'ﹸ'], 'ِ' : ['ﹺ', 'ﹺ', 'ﹺ', 'ﹺ'], 'ّ' : ['ﹼ', 'ﹼ', 'ﹼ', 'ﹼ'], 'ْ' : ['ﹾ', 'ﹾ', 'ﹾ', 'ﹾ'],
  'ٱ': ['ﭐ', 'ﭑ', 'ﭐ', 'ﭑ'], 'ٻ': ['ﭒ', 'ﭓ', 'ﭔ', 'ﭕ'], 'پ': ['ﭖ', 'ﭗ', 'ﭘ', 'ﭙ'], 'ڀ': ['ﭚ', 'ﭛ', 'ﭜ', 'ﭝ'],
  'ٺ': ['ﭞ', 'ﭟ', 'ﭠ', 'ﭡ'], 'ٿ': ['ﭢ', 'ﭣ', 'ﭤ', 'ﭥ'], 'ٹ': ['ﭦ', 'ﭧ', 'ﭨ', 'ﭩ'], 'ڤ': ['ﭪ', 'ﭫ', 'ﭬ', 'ﭭ'],
  'ڦ': ['ﭮ', 'ﭯ', 'ﭰ', 'ﭱ'], 'ڄ': ['ﭲ', 'ﭳ', 'ﭴ', 'ﭵ'], 'ڃ': ['ﭶ', 'ﭷ', 'ﭸ', 'ﭹ'], 'چ': ['ﭺ', 'ﭻ', 'ﭼ', 'ﭽ'],
  'ڇ': ['ﭾ', 'ﭿ', 'ﮀ', 'ﮁ'], 'ڍ': ['ﮂ', 'ﮃ', 'ﮂ', 'ﮃ'], 'ڌ': ['ﮄ', 'ﮅ', 'ﮄ', 'ﮅ'], 'ڎ': ['ﮆ', 'ﮇ', 'ﮆ', 'ﮇ'],
  'ڈ': ['ﮈ', 'ﮉ', 'ﮈ', 'ﮉ'], 'ژ': ['ﮊ', 'ﮋ', 'ﮊ', 'ﮋ'], 'ڑ': ['ﮌ', 'ﮍ', 'ﮌ', 'ﮍ'], 'ک': ['ﮎ', 'ﮏ', 'ﮐ', 'ﮑ'],
  'گ': ['ﮒ', 'ﮓ', 'ﮔ', 'ﮕ'], 'ڳ': ['ﮖ', 'ﮗ', 'ﮘ', 'ﮙ'], 'ڱ': ['ﮚ', 'ﮛ', 'ﮜ', 'ﮝ'], 'ں': ['ﮞ', 'ﮟ', 'ﯨ', 'ﯩ'],
  'ڻ': ['ﮠ', 'ﮡ', 'ﮢ', 'ﮣ'], 'ۀ': ['ﮤ', 'ﮥ', 'ﮤ', 'ﮥ'], 'ہ': ['ﮦ', 'ﮧ', 'ﮨ', 'ﮩ'], 'ھ': ['ﮪ', 'ﮫ', 'ﮬ', 'ﮭ'],
  'ے': ['ﮮ', 'ﮯ', 'ﮮ', 'ﮯ'], 'ۓ': ['ﮰ', 'ﮱ', 'ﮰ', 'ﮱ'], 'ڭ': ['ﯓ', 'ﯔ', 'ﯕ', 'ﯖ'], 'ۇ': ['ﯗ', 'ﯘ', 'ﯗ', 'ﯘ'],
  'ۆ': ['ﯙ', 'ﯚ', 'ﯙ', 'ﯚ'], 'ۈ': ['ﯛ', 'ﯜ', 'ﯛ', 'ﯜ'], 'ۋ': ['ﯞ', 'ﯟ', 'ﯞ', 'ﯟ'], 'ۅ': ['ﯠ', 'ﯡ', 'ﯠ', 'ﯡ'],
  'ۉ': ['ﯢ', 'ﯣ', 'ﯢ', 'ﯣ'], 'ې': ['ﯤ', 'ﯥ', 'ﯦ', 'ﯧ'], 'ی': ['ﯼ', 'ﯽ', 'ﯾ', 'ﯿ']
}

const MERGED_ARABIC_TABLE = {
  'ﻵ': "ﻟﺂ", 'ﻶ': "ﻠﺂ", 'ﻷ': "ﻟﺄ", 'ﻸ': "ﻠﺄ", 'ﻹ': "ﻟﺈ", 'ﻺ': "ﻠﺈ", 'ﻻ': "ﻟﺎ", 'ﻼ': "ﻠﺎ",
  'ﯪ': 'ﺋﺎ', 'ﯫ': 'ﺌﺎ', 'ﯬ': 'ﺋﻪ', 'ﯭ': 'ﺌﻪ', 'ﯮ': 'ﺋﻮ', 'ﯯ': 'ﺌﻮ', 'ﰄ': 'ﺋﻲ', 'ﱩ': 'ﺌﻲ', 'ﯸ': 'ﺋﻴ', 'ﰃ': 'ﺋﻰ',
  'ﱨ': 'ﺌﻰ', 'ﰀ': 'ﺋﺞ', 'ﰁ': 'ﺋﺢ', 'ﰂ': 'ﺋﻢ', 'ﰅ': 'ﺑﺞ', 'ﰆ': 'ﺑﺢ', 'ﰇ': 'ﺑﺦ', 'ﰈ': 'ﺑﻢ', 'ﰉ': 'ﺑﻰ', 'ﰊ': 'ﺑﻲ',
  'ﰋ': 'ﺗﺞ', 'ﰌ': 'ﺗﺢ', 'ﰍ': 'ﺗﺦ', 'ﰎ': 'ﺗﻢ', 'ﰏ': 'ﺗﻰ', 'ﰐ': 'ﺗﻲ', 'ﰑ': 'ﺛﺞ', 'ﰒ': 'ﺛﻢ', 'ﰓ': 'ﺛﻰ', 'ﰔ': 'ﺛﻲ',
  'ﰕ': 'ﺟﺢ', 'ﰖ': 'ﺟﻢ', 'ﰗ': 'ﺣﺞ', 'ﰘ': 'ﺣﻢ', 'ﰙ': 'ﺧﺞ', 'ﰚ': 'ﺧﺢ', 'ﰛ': 'ﺧﻢ', 'ﰜ': 'ﺳﺞ', 'ﰝ': 'ﺳﺢ', 'ﰞ': 'ﺳﺦ',
  'ﰟ': 'ﺳﻢ', 'ﰠ': 'ﺻﺢ', 'ﰡ': 'ﺻﻢ', 'ﰢ': 'ﺿﺞ', 'ﰣ': 'ﺿﺢ', 'ﰤ': 'ﺿﺦ', 'ﰥ': 'ﺿﻢ', 'ﰦ': 'ﻃﺢ', 'ﰧ': 'ﻃﻢ', 'ﰨ': 'ﻇﻢ',
  'ﰩ': 'ﻋﺞ', 'ﰪ': 'ﻋﻢ', 'ﰫ': 'ﻏﺞ', 'ﰬ': 'ﻏﻢ', 'ﰭ': 'ﻓﺞ', 'ﰮ': 'ﻓﺢ', 'ﰯ': 'ﻓﺦ', 'ﰰ': 'ﻓﻢ', 'ﰱ': 'ﻓﻰ', 'ﰲ': 'ﻓﻲ',
  'ﰳ': 'ﻗﺢ', 'ﰴ': 'ﻗﻢ', 'ﰵ': 'ﻗﻰ', 'ﰶ': 'ﻗﻲ', 'ﰷ': 'ﻛﺎ', 'ﰸ': 'ﻛﺞ', 'ﰹ': 'ﻛﺢ', 'ﰺ': 'ﻛﺦ', 'ﰻ': 'ﻛﻞ', 'ﰼ': 'ﻛﻢ',
  'ﰽ': 'ﻛﻰ', 'ﰾ': 'ﻛﻲ', 'ﰿ': 'ﻟﺞ', 'ﱀ': 'ﻟﺢ', 'ﱁ': 'ﻟﺦ', 'ﱂ': 'ﻟﻢ', 'ﱃ': 'ﻟﻰ', 'ﱄ': 'ﻟﻲ', 'ﱅ': 'ﻣﺞ', 'ﱆ': 'ﻣﺢ',
  'ﱇ': 'ﻣﺦ', 'ﱈ': 'ﻣﻢ', 'ﱉ': 'ﻣﻰ', 'ﱊ': 'ﻣﻲ', 'ﱋ': 'ﻧﺞ', 'ﱌ': 'ﻧﺢ', 'ﱍ': 'ﻧﺦ', 'ﱎ': 'ﻧﻢ', 'ﱏ': 'ﻧﻰ', 'ﱐ': 'ﻧﻲ',
  'ﱑ': 'ﻫﺞ', 'ﱒ': 'ﻫﻢ', 'ﱓ': 'ﻫﻰ', 'ﱔ': 'ﻫﻲ', 'ﱕ': 'ﻳﺞ', 'ﱖ': 'ﻳﺢ', 'ﱗ': 'ﻳﺦ', 'ﱘ': 'ﻳﻢ', 'ﱙ': 'ﻳﻰ', 'ﱚ': 'ﻳﻲ',
  'ﱞ': 'ﹼﹲ', 'ﱟ': 'ﹼﹴ', 'ﱠ': 'ﹼﹶ', 'ﱡ': 'ﹼﹸ', 'ﱢ': 'ﹼﹺ', 'ﱤ': 'ﺌﺮ', 'ﱥ': 'ﺌﺰ', 'ﱦ': 'ﺌﻢ', 'ﱧ': 'ﺌﻦ', 'ﱪ': 'ﺒﺮ',
  'ﱫ': 'ﺒﺰ', 'ﱬ': 'ﺒﻢ', 'ﱭ': 'ﺒﻦ', 'ﱮ': 'ﺒﻰ', 'ﱯ': 'ﺒﻲ', 'ﱰ': 'ﺘﺮ', 'ﱱ': 'ﺘﺰ', 'ﱲ': 'ﺘﻢ', 'ﱳ': 'ﺘﻦ', 'ﱴ': 'ﺘﻰ',
  'ﱵ': 'ﺘﻲ', 'ﱶ': 'ﺜﺮ', 'ﱷ': 'ﺜﺰ', 'ﱸ': 'ﺜﻢ', 'ﱹ': 'ﺜﻦ', 'ﱺ': 'ﺜﻰ', 'ﱻ': 'ﺜﻲ', 'ﱼ': 'ﻔﻰ', 'ﱽ': 'ﻔﻲ', 'ﱾ': 'ﻘﻰ',
  'ﱿ': 'ﻘﻲ', 'ﲀ': 'ﻜﺎ', 'ﲁ': 'ﻜﻞ', 'ﲂ': 'ﻜﻢ', 'ﲃ': 'ﻜﻰ', 'ﲄ': 'ﻜﻲ', 'ﲅ': 'ﻠﻢ', 'ﲆ': 'ﻠﻰ', 'ﲇ': 'ﻠﻲ', 'ﲈ': 'ﻤﺎ',
  'ﲉ': 'ﻤﻢ', 'ﲊ': 'ﻨﺮ', 'ﲋ': 'ﻨﺰ', 'ﲌ': 'ﻨﻢ', 'ﲍ': 'ﻨﻦ', 'ﲎ': 'ﻨﻰ', 'ﲏ': 'ﻨﻲ', 'ﲑ': 'ﻴﺮ', 'ﲒ': 'ﻴﺰ', 'ﲓ': 'ﻴﻢ',
  'ﲔ': 'ﻴﻦ', 'ﲕ': 'ﻴﻰ', 'ﲖ': 'ﻴﻲ', 'ﲗ': 'ﺋﺠ', 'ﲘ': 'ﺋﺤ', 'ﲙ': 'ﺋﺨ', 'ﲚ': 'ﺋﻤ', 'ﲛ': 'ﺋﻬ', 'ﲜ': 'ﺑﺠ', 'ﲝ': 'ﺑﺤ',
  'ﲞ': 'ﺑﺨ', 'ﲟ': 'ﺑﻤ', 'ﲠ': 'ﺑﻬ', 'ﲡ': 'ﺗﺠ', 'ﲢ': 'ﺗﺤ', 'ﲣ': 'ﺗﺨ', 'ﲤ': 'ﺗﻤ', 'ﲥ': 'ﺗﻬ', 'ﳥ': 'ﺜﻤ', 'ﲧ': 'ﺟﺤ',
  'ﲨ': 'ﺟﻤ', 'ﲩ': 'ﺣﺠ', 'ﲪ': 'ﺣﻤ', 'ﲫ': 'ﺧﺠ', 'ﲬ': 'ﺧﻤ', 'ﲭ': 'ﺳﺠ', 'ﲮ': 'ﺳﺤ', 'ﲯ': 'ﺳﺨ', 'ﲰ': 'ﺳﻤ', 'ﲱ': 'ﺻﺤ',
  'ﲲ': 'ﺻﺨ', 'ﲳ': 'ﺻﻤ', 'ﲴ': 'ﺿﺠ', 'ﲵ': 'ﺿﺤ', 'ﲶ': 'ﺿﺨ', 'ﲷ': 'ﺿﻤ', 'ﲸ': 'ﻃﺤ', 'ﲹ': 'ﻇﻤ', 'ﲺ': 'ﻋﺠ', 'ﲻ': 'ﻋﻤ',
  'ﲼ': 'ﻏﺠ', 'ﲽ': 'ﻏﻤ', 'ﲾ': 'ﻓﺠ', 'ﲿ': 'ﻓﺤ', 'ﳀ': 'ﻓﺨ', 'ﳁ': 'ﻓﻤ', 'ﳂ': 'ﻗﺤ', 'ﳃ': 'ﻗﻤ', 'ﳄ': 'ﻛﺠ', 'ﳅ': 'ﻛﺤ',
  'ﳆ': 'ﻛﺨ', 'ﳇ': 'ﻛﻠ', 'ﳈ': 'ﻛﻤ', 'ﳉ': 'ﻟﺠ', 'ﳊ': 'ﻟﺤ', 'ﳋ': 'ﻟﺨ', 'ﳌ': 'ﻟﻤ', 'ﳍ': 'ﻟﻬ', 'ﳎ': 'ﻣﺠ', 'ﳏ': 'ﻣﺤ',
  'ﳐ': 'ﻣﺨ', 'ﳑ': 'ﻣﻤ', 'ﳒ': 'ﻧﺠ', 'ﳓ': 'ﻧﺤ', 'ﳔ': 'ﻧﺨ', 'ﳕ': 'ﻧﻤ', 'ﳖ': 'ﻧﻬ', 'ﳗ': 'ﻫﺠ', 'ﳘ': 'ﻫﻤ', 'ﳚ': 'ﻳﺠ',
  'ﳛ': 'ﻳﺤ', 'ﳜ': 'ﻳﺨ', 'ﳝ': 'ﻳﻤ', 'ﳞ': 'ﻳﻬ', 'ﳟ': 'ﺌﻤ', 'ﳠ': 'ﺌﻬ', 'ﳡ': 'ﺒﻤ', 'ﳢ': 'ﺒﻬ', 'ﳣ': 'ﺘﻤ', 'ﳤ': 'ﺘﻬ',
  'ﳦ': 'ﺜﻬ', 'ﳧ': 'ﺴﻤ', 'ﳨ': 'ﺴﻬ', 'ﳩ': 'ﺸﻤ', 'ﳪ': 'ﺸﻬ', 'ﳫ': 'ﻜﻠ', 'ﳬ': 'ﻜﻤ', 'ﳭ': 'ﻠﻤ', 'ﳮ': 'ﻨﻤ', 'ﳯ': 'ﻨﻬ',
  'ﳰ': 'ﻴﻤ', 'ﳱ': 'ﻴﻬ', 'ﳵ': 'ﻃﻰ', 'ﳶ': 'ﻃﻲ', 'ﳷ': 'ﻋﻰ', 'ﳸ': 'ﻋﻲ', 'ﳹ': 'ﻏﻰ', 'ﳺ': 'ﻏﻲ', 'ﳻ': 'ﺳﻰ', 'ﳼ': 'ﺳﻲ',
  'ﳽ': 'ﺷﻰ', 'ﳾ': 'ﺷﻲ', 'ﳿ': 'ﺣﻰ', 'ﴀ': 'ﺣﻲ', 'ﴁ': 'ﺟﻰ', 'ﴂ': 'ﺟﻲ', 'ﴃ': 'ﺧﻰ', 'ﴄ': 'ﺧﻲ', 'ﴅ': 'ﺻﻰ', 'ﴆ': 'ﺻﻲ',
  'ﴇ': 'ﺿﻰ', 'ﴈ': 'ﺿﻲ', 'ﴉ': 'ﺷﺞ', 'ﴊ': 'ﺷﺢ', 'ﴋ': 'ﺷﺦ', 'ﴌ': 'ﺷﻢ', 'ﴍ': 'ﺷﺮ', 'ﴎ': 'ﺳﺮ', 'ﴏ': 'ﺻﺮ', 'ﴐ': 'ﺿﺮ',
  'ﴑ': 'ﻄﻰ', 'ﴒ': 'ﻄﻲ', 'ﴓ': 'ﻌﻰ', 'ﴔ': 'ﻌﻲ', 'ﴕ': 'ﻐﻰ', 'ﴖ': 'ﻐﻲ', 'ﴗ': 'ﺴﻰ', 'ﴘ': 'ﺴﻲ', 'ﴙ': 'ﺸﻰ', 'ﴚ': 'ﺸﻲ',
  'ﴛ': 'ﺤﻰ', 'ﴜ': 'ﺤﻲ', 'ﴝ': 'ﺠﻰ', 'ﴞ': 'ﺠﻲ', 'ﴟ': 'ﺨﻰ', 'ﴠ': 'ﺨﻲ', 'ﴡ': 'ﺼﻰ', 'ﴢ': 'ﺼﻲ', 'ﴣ': 'ﻀﻰ', 'ﴤ': 'ﻀﻲ',
  'ﴥ': 'ﺸﺞ', 'ﴦ': 'ﺸﺢ', 'ﴧ': 'ﺸﺦ', 'ﴨ': 'ﺸﻢ', 'ﴩ': 'ﺸﺮ', 'ﴪ': 'ﺴﺮ', 'ﴫ': 'ﺼﺮ', 'ﴬ': 'ﻀﺮ', 'ﴭ': 'ﺷﺠ', 'ﴮ': 'ﺷﺤ',
  'ﴯ': 'ﺷﺨ', 'ﴰ': 'ﺷﻤ', 'ﴱ': 'ﺳﻬ', 'ﴲ': 'ﺷﻬ', 'ﴳ': 'ﻃﻤ', 'ﴴ': 'ﺴﺠ', 'ﴵ': 'ﺴﺤ', 'ﴶ': 'ﺴﺨ', 'ﴷ': 'ﺸﺠ', 'ﴸ': 'ﺸﺤ',
  'ﴹ': 'ﺸﺨ', 'ﴺ': 'ﻄﻤ', 'ﴻ': 'ﻈﻤ', 'ﴼ': 'ﺎﱟ', 'ﴽ': 'ﺍﱟ', 'ﵐ': 'ﺗﺠﻤ', 'ﵑ': 'ﺘﺤﺞ', 'ﵒ': 'ﺗﺤﺠ', 'ﵓ': 'ﺗﺤﻤ', 'ﵔ': 'ﺗﺨﻤ',
  'ﵕ': 'ﺗﻤﺠ', 'ﵖ': 'ﺗﻤﺤ', 'ﵗ': 'ﺗﻤﺨ', 'ﵘ': 'ﺠﻤﺢ', 'ﵙ': 'ﺟﻤﺤ', 'ﵚ': 'ﺤﻤﻲ', 'ﵛ': 'ﺤﻤﻰ', 'ﵜ': 'ﺳﺤﺠ', 'ﵝ': 'ﺳﺠﺤ',
  'ﵞ': 'ﺴﺠﻰ', 'ﵟ': 'ﺴﻤﺢ', 'ﵠ': 'ﺳﻤﺤ', 'ﵡ': 'ﺳﻤﺠ', 'ﵢ': 'ﺴﻤﻢ', 'ﵣ': 'ﺳﻤﻤ', 'ﵤ': 'ﺼﺤﺢ', 'ﵥ': 'ﺻﺤﺤ', 'ﵦ': 'ﺼﻤﻢ',
  'ﵧ': 'ﺸﺤﻢ', 'ﵨ': 'ﺷﺤﻤ', 'ﵩ': 'ﺸﺠﻲ', 'ﵪ': 'ﺸﻤﺦ', 'ﵫ': 'ﺷﻤﺨ', 'ﵬ': 'ﺸﻤﻢ', 'ﵭ': 'ﺷﻤﻤ', 'ﵮ': 'ﻀﺤﻰ', 'ﵯ': 'ﻀﺨﻢ',
  'ﵰ': 'ﺿﺨﻤ', 'ﵱ': 'ﻄﻤﺢ', 'ﵲ': 'ﻃﻤﺤ', 'ﵳ': 'ﻃﻤﻤ', 'ﵴ': 'ﻄﻤﻲ', 'ﵵ': 'ﻌﺠﻢ', 'ﵶ': 'ﻌﻤﻢ', 'ﵷ': 'ﻋﻤﻤ', 'ﵸ': 'ﻌﻤﻰ',
  'ﵹ': 'ﻐﻤﻢ', 'ﵺ': 'ﻐﻤﻲ', 'ﵻ': 'ﻐﻤﻰ', 'ﵼ': 'ﻔﺨﻢ', 'ﵽ': 'ﻓﺨﻤ', 'ﵾ': 'ﻘﻤﺢ', 'ﵿ': 'ﻘﻤﻢ', 'ﶀ': 'ﻠﺤﻢ', 'ﶁ': 'ﻠﺤﻲ',
  'ﶂ': 'ﻠﺤﻰ', 'ﶃ': 'ﻟﺠﺠ', 'ﶄ': 'ﻠﺠﺞ', 'ﶀ': 'ﻠﺨﻢ', 'ﶆ': 'ﻟﺨﻤ', 'ﶇ': 'ﻠﻤﺢ', 'ﶈ': 'ﻟﻤﺤ', 'ﶉ': 'ﻣﺤﺠ', 'ﶊ': 'ﻣﺤﻤ',
  'ﶋ': 'ﻤﺤﻲ', 'ﶌ': 'ﻣﺠﺤ', 'ﶍ': 'ﻣﺠﻤ', 'ﶎ': 'ﻣﺨﺠ', 'ﶏ': 'ﻣﺨﻤ', 'ﶒ': 'ﻣﺠﺨ', 'ﶓ': 'ﻫﻤﺠ', 'ﶔ': 'ﻫﻤﻤ', 'ﶕ': 'ﻧﺤﻤ',
  'ﶖ': 'ﻨﺤﻰ', 'ﶗ': 'ﻨﺤﻢ', 'ﶘ': 'ﻧﺠﻤ', 'ﶙ': 'ﻨﺠﻰ', 'ﶚ': 'ﻨﻤﻲ', 'ﶛ': 'ﻨﻤﻰ', 'ﶜ': 'ﻴﻤﻢ', 'ﶝ': 'ﻳﻤﻤ', 'ﶞ': 'ﺒﺨﻲ',
  'ﶟ': 'ﺘﺠﻲ', 'ﶠ': 'ﺘﺠﻰ', 'ﶡ': 'ﺘﺨﻲ', 'ﶢ': 'ﺘﺨﻰ', 'ﶣ': 'ﺘﻤﻲ', 'ﶤ': 'ﺘﻤﻰ', 'ﶥ': 'ﺠﻤﻲ', 'ﶦ': 'ﺠﺤﻰ', 'ﶧ': 'ﺠﻤﻰ',
  'ﶨ': 'ﺴﺨﻰ', 'ﶩ': 'ﺼﺤﻲ', 'ﶪ': 'ﺸﺤﻲ', 'ﶫ': 'ﻀﺤﻲ', 'ﶬ': 'ﻠﺠﻲ', 'ﶭ': 'ﻠﻤﻲ', 'ﶮ': 'ﻴﺤﻲ', 'ﶯ': 'ﻴﺠﻲ', 'ﶰ': 'ﻴﻤﻲ',
  'ﶱ': 'ﻤﻤﻲ', 'ﶲ': 'ﻘﻤﻲ', 'ﶳ': 'ﻨﺤﻲ', 'ﶴ': 'ﻗﻤﺤ', 'ﶵ': 'ﻟﺤﻤ', 'ﶶ': 'ﻌﻤﻲ', 'ﶷ': 'ﻜﻤﻲ', 'ﶸ': 'ﻧﺠﺤ', 'ﶹ': 'ﻤﺨﻲ',
  'ﶺ': 'ﻟﺠﻤ', 'ﶻ': 'ﻜﻤﻢ', 'ﶼ': 'ﻠﺠﻢ', 'ﶽ': 'ﻨﺠﺢ', 'ﶾ': 'ﺠﺤﻲ', 'ﶿ': 'ﺤﺠﻲ', 'ﷀ': 'ﻤﺠﻲ', 'ﷁ': 'ﻔﻤﻲ', 'ﷂ': 'ﺒﺤﻲ',
  'ﷃ': 'ﻛﻤﻤ', 'ﷄ': 'ﻋﺠﻤ', 'ﷅ': 'ﺻﻤﻤ', 'ﷆ': 'ﺴﺨﻲ', 'ﷇ': 'ﻨﺠﻲ', 'ﷲ': 'ﺍﻟﻠﻪ', 'ﷳ': 'ﺍﻛﺒﺮ', 'ﷴ': 'ﻣﺤﻤﺪ', 'ﷵ': 'ﺻﻠﻌﻢ',
  'ﷶ': 'ﺭﺳﻮﻝ', 'ﷺ': 'ﺻﻠﻰ ﺍﻟﻠﻪ ﻋﻠﻴﻪ ﻭﺳﻠﻢ', 'ﷷ': 'ﻋﻠﻴﻪ', 'ﷸ': 'ﻭﺳﻠﻢ', 'ﷹ': 'ﺻﻠﻰ', 'ﷻ': 'ﺟﻞ ﺟﻼﻟﻪ', '﷼': 'ﺭﻳﺎﻝ',
  '﷽': 'ﺑﺴﻢ ﺍﻟﻠﻪ ﺍﻟﺮﺣﻤﻦ ﺍﻟﺮﺣﻴﻢ'
}

const ALL_HARAKAT = HARAKAT + FREEZED_HARAKAT;
const FULL_ARABIC = ARABIC_CHARS + ARABIC_SYMBOLS + FREEZED_ARABIC_CHARS + HARAKAT + FREEZED_HARAKAT + Object.keys(MERGED_ARABIC_TABLE).join("") + BOWS_LIST.join("") + RETURNS + " ";
const HARAKAT_PATTERN = "[" + HARAKAT + FREEZED_HARAKAT + "]";
